app/Http/Controllers/ProductController.php

    public function index(){
        $products = Product::all();
---
SELECT * FROM `products`

    public function show($slug){
        $product = Product::where('slug', $slug)->firstOrFail();
---
SELECT * FROM `products` WHERE `slug` = 'nike-dunk-low-retro' LIMIT 1

    public function create(Request $request)
    {
        // Valideren van invoergegevens aanmaken product
        $request->validate([
            'name' => 'required|string|max:255',
            'description' => 'required|string',
            'price' => 'required|numeric|min:1',
        ]);

        $product = new Product();
        // invoeren van de productgegevens vanuit het aanmaak verzoek
        $product->name = $request->name;
        $product->description = $request->description;
        $product->price = $request->price;
        // Opslaan van het product
        $product->save();
---
INSERT INTO `products` (`name`, `description`, `price`, `updated_at`, `created_at`) VALUES ('Nike Shoe', 'schoetje', '12222', '2024-04-08 23:01:56', '2024-04-08 23:01:56')

    public function update(Request $request, $id)
    {
        $product = Product::findOrFail($id);

        // Updaten van de productgegevens met de gegevens uit het update verzoek
        $product->name = $request->name;
        $product->description = $request->description;
        $product->price = $request->price;

        // Opslaan van de bijgewerkte productgegevens
        $product->save();
---
SELECT * FROM `products` WHERE `products`.`id` = '10' LIMIT 1
UPDATE `products` SET `name` = 'Nike', `description` = 'wewe', `price` = '10', `products`.`updated_at` = '2024-04-08 22:58:32' WHERE `id` = 10

    public function destroy($id)
    {
        // Zoek het product dat moet worden verwijderd
        $product = Product::findOrFail($id);

        // Verwijder het product
        $product->delete();
---
SELECT * FROM `products` WHERE `products`.`id` = '1' LIMIT 1
DELETE FROM `products` WHERE `id` = 1