app/Http/Controllers/RegisterController.php

INSERT INTO `users` (`name`, `username`, `email`, `password`, `updated_at`, `created_at`) VALUES ('sadsdd', 'aads', 'g@gmail.com', '$2y$12$SWwGUKPEhH0MGWN5ZA401.wNfObkdylktfSZWJcFOhP/AlF7ehgt6', '2024-04-08 22:40:37', '2024-04-08 22:40:37')
---
    public function store(){
        $attributes = request()->validate([
            'name' => ['min:3', 'max:255', 'required', ],
            'username' => ['min:3', 'max:255', 'required', Rule::unique('users','username')],
            'email' => ['min:3', 'max:255', 'email', 'required', Rule::unique('users','name')],
            'password' => ['min:6', 'max:255', 'required', Rule::unique('users','username')],
        ]);

        $user = User::create($attributes);